bernabeu-a/archc-msp430x/msp430x_isa.cpp
#include <iostream>
#include <cstdlib>

#include  "msp430x_isa.H"
#include  "msp430x_isa_init.cpp"
#include  "msp430x_bhv_macros.H"

#include "sytare-syscalls/syscalls.h"
#include "energy_manager.h"
#include "energy_logger.h"
#include "commands.h"
#include "options.h"

#define REG_PC  0
#define REG_SP  1
#define REG_SR  2
#define REG_CG1 REG_SR
#define REG_CG2 3

const uint16_t SRAM_BEGIN  = 0x1c00;
const uint16_t SRAM_END    = 0x2000;

const uint16_t PERIPH_BEGIN = 0x0000;
const uint16_t PERIPH_END   = 0x1000;

//!'using namespace' statement to allow access to all msp430x-specific datatypes
using namespace msp430x_parms;

struct arch_context_t
{
    ac_memport<msp430x_parms::ac_word, msp430x_parms::ac_Hword> &DM;
    ac_regbank<16, msp430x_parms::ac_word, msp430x_parms::ac_Dword>& RB;
    ac_reg<unsigned> &ac_pc;
    std::function<void()> ac_annul;
    uint16_t pc;

    arch_context_t(
        ac_memport<msp430x_parms::ac_word, msp430x_parms::ac_Hword> &DM,
        ac_regbank<16, msp430x_parms::ac_word, msp430x_parms::ac_Dword>& RB,
        ac_reg<unsigned> &ac_pc,
        std::function<void()> ac_annul):
        DM(DM),
        RB(RB),
        ac_pc(ac_pc),
        ac_annul(ac_annul)
    {
    }
};

struct sr_flags_t
{
    // Never write to those fields firectly. Reading is fine.
    unsigned int V, SCG1, SCG0, OSCOFF, CPUOFF, GIE, N, Z, C;
    ac_regbank<16, msp430x_parms::ac_word, msp430x_parms::ac_Dword>& RB;

    sr_flags_t(
        ac_regbank<16, msp430x_parms::ac_word, msp430x_parms::ac_Dword>& RB):
        RB(RB)
    {
        uint16_t sr = RB[REG_SR];
        V      = ((sr >> 8) & 1);
        SCG1   = ((sr >> 7) & 1);
        SCG0   = ((sr >> 6) & 1);
        OSCOFF = ((sr >> 5) & 1);
        CPUOFF = ((sr >> 4) & 1);
        GIE    = ((sr >> 3) & 1);
        N      = ((sr >> 2) & 1);
        Z      = ((sr >> 1) & 1);
        C      = ((sr     ) & 1);
    }

    void set_V(unsigned int value)
    {
        V = (value ? 1 : 0);
        update_register();
    }

    void set_N(unsigned int value)
    {
        N = (value ? 1 : 0);
        update_register();
    }

    void set_Z(unsigned int value)
    {
        Z = (value ? 1 : 0);
        update_register();
    }

    void set_C(unsigned int value)
    {
        C = (value ? 1 : 0);
        update_register();
    }

    void set_GIE(unsigned int value)
    {
        GIE = (value ? 1 : 0);
        update_register();
    }

    void update_register(void)
    {
        RB[REG_SR] = (V      << 8)
                   | (SCG1   << 7)
                   | (SCG0   << 6)
                   | (OSCOFF << 5)
                   | (CPUOFF << 4)
                   | (GIE    << 3)
                   | (N      << 2)
                   | (Z      << 1)
                   | (C          );
    }

    void on_interrupt(void)
    {
        RB[REG_SR] &= (SCG0 << 6);
        V      = 0;
        SCG1   = 0;
        OSCOFF = 0;
        CPUOFF = 0;
        GIE    = 0;
        N      = 0;
        Z      = 0;
        C      = 0;

        // TODO out of LPM
    }

    void dump(void) const
    {
        std::cout << "# SR" << std::endl
                  << "  + V = " << V << std::endl
                  << "  + N = " << V << std::endl
                  << "  + Z = " << V << std::endl
                  << "  + C = " << V << std::endl;
    }
};

enum extension_state_e
{
    EXT_NONE,
    EXT_RDY,
    EXT_RUN,
    EXT_ERROR
};

struct extension_t
{
    uint16_t payload_h, payload_l, al;
    extension_state_e state;

    extension_t():
        state(EXT_NONE)
    {
    }

    void tick()
    {
        if(state == EXT_RDY)
            state = EXT_RUN;
        else if(state == EXT_RUN)
        {
            state = EXT_ERROR;
            std::cerr << "Extension state error (Oops)" << std::endl;
        }
    }
};

struct extension_repeat_t
{
    uint16_t zc, al, count;
};

enum addressing_mode_e
{
    AM_REGISTER = 0,
    AM_INDEXED = 1,
    AM_INDIRECT_REG = 2,
    AM_INDIRECT_INCR = 3,
    AM_INVALID
};

static arch_context_t *context = nullptr;

static extension_t extension;
static platform_t *platform;
static Syscalls *syscalls;
static EnergyLogger elogger(std::cout);
static PowerSupply *supply;
static EnergyManager *emanager;
static Commands *commands;
static MPU *mpu;

static inline size_t ESTIMATE_PIPELINE(size_t ncycles)
{
    if(ncycles)
        return ncycles - 1;
    return ncycles;
}

static unsigned int negative16(uint16_t x)
{
    return x >> 15;
}

static unsigned int negative8(uint8_t x)
{
    return x >> 7;
}

static unsigned int carry16(uint32_t x)
{
    return x & (1 << 16);
}

static unsigned int carry8(uint32_t x)
{
    return x & (1 << 8);
}

static unsigned int overflow16(uint16_t op1, uint16_t op2, uint16_t result)
{
    return (~(op1 ^ op2) & (result ^ op1)) >> 15;
}

static unsigned int overflow8(uint8_t op1, uint8_t op2, uint8_t result)
{
    return (~(op1 ^ op2) & (result ^ op1)) >> 7;
}

static int16_t u10_to_i16(uint16_t u10)
{
    uint16_t tmp = (u10 & 0x01ff);
    if(u10 & (1 << 9))
        tmp |= 0xfe00;
    return tmp;
}

static uint16_t doubleop_source(
    MPU *mpu,
    ac_regbank<16, msp430x_parms::ac_word, msp430x_parms::ac_Dword>& RB,
    uint16_t as, uint16_t bw, uint16_t rsrc)
{
    uint16_t operand;

    switch(as)
    {
        case AM_REGISTER:
            if(rsrc == REG_CG2)
                operand = 0;
            else
            {
                operand = RB[rsrc] - (rsrc == REG_PC ? 2 : 0);
                if(bw)
                    operand &= 0xff;
            }
            break;

        case AM_INDEXED:
            if(rsrc == REG_CG2)
                operand = 0x1;
            else
            {
                uint16_t x = mpu->read(RB[REG_PC]);
                if(rsrc != REG_CG1)
                    x += RB[rsrc];

                if(bw)
                    operand = mpu->read_byte(x);
                else
                    operand = mpu->read(x);
                RB[REG_PC] += 2;
            }
            break;

        case AM_INDIRECT_REG:
            if(rsrc == REG_CG2)
                operand = 0x2;
            else if(rsrc == REG_CG1)
                operand = 0x4;
            else
            {
                if(bw)
                    operand = mpu->read_byte(RB[rsrc]);
                else
                    operand = mpu->read(RB[rsrc]);
            }
            break;

        case AM_INDIRECT_INCR:
            if(rsrc == REG_CG2)
                operand = 0xffff;
            else if(rsrc == REG_CG1)
                operand = 0x8;
            else
            {
                operand = mpu->read(RB[rsrc]);
                // /!\ Here, pc may change if rsrc==0, which is the expected behavior
                // TODO: 20bit address mode?
                if(rsrc == REG_PC || !bw)
                    RB[rsrc] += 2;
                else
                    RB[rsrc] += 1;
            }
            break;

        default:
            // Oops
            break;
    }

    return operand;
}

