bernabeu-a/archc-msp430x/msp430x_isa.cpp
static uint16_t doubleop_dest_operand(
    MPU *mpu,
    ac_regbank<16, msp430x_parms::ac_word, msp430x_parms::ac_Dword>& RB,
    uint16_t ad, uint16_t bw, uint16_t rdst)
{
    switch(ad)
    {
        case AM_REGISTER:
            return RB[rdst];

        case AM_INDEXED:
        {
            uint16_t x = mpu->read(RB[REG_PC]);
            if(rdst != REG_CG1)
                x += RB[rdst];

            if(bw)
                return mpu->read_byte(x);
            else
                return mpu->read(x);
        }

        default:
            // Oops
            break;
    }
    return -1;
}

static void doubleop_dest(
    MPU *mpu,
    ac_regbank<16, msp430x_parms::ac_word, msp430x_parms::ac_Dword>& RB,
    uint16_t operand,
    uint16_t ad, uint16_t bw, uint16_t rdst)
{
    switch(ad)
    {
        case AM_REGISTER:
            RB[rdst] = operand;
            break;

        case AM_INDEXED:
        {
            uint16_t x = mpu->read(RB[REG_PC]);
            if(rdst != REG_CG1)
                x += RB[rdst];

            if(bw)
                mpu->write_byte(x, operand);
            else
                mpu->write(x, operand);
            RB[REG_PC] += 2;
            break;
        }

        default:
            // Oops
            break;
    }
}

static size_t doubleop_cycles(uint8_t as, uint8_t ad, uint8_t rsrc, uint8_t rdst, bool shorter)
{
    switch(as)
    {
        case AM_REGISTER: // src = Rn
            if(ad == AM_REGISTER) // dst = Rm or dst = PC
                return rdst == REG_PC ? 3 : 1;
            return shorter ? 3 : 4;

        case AM_INDEXED: // src = ADDR or src = &ADDR or src = X(Rn)
            if(ad == AM_REGISTER) // dst = Rm or dst = PC
                return rdst == REG_PC ? 5 : 3;
            return shorter ? 5 : 6;

        case AM_INDIRECT_REG: // src = @Rn
            if(ad == AM_REGISTER) // dst = Rm or dst = PC
                return rdst == REG_PC ? 4 : 2;
            return shorter ? 4 : 5;

        case AM_INDIRECT_INCR:
            if(rsrc == REG_PC) // src = #N
            {
                if(ad == AM_REGISTER) // dst = Rm or dst = PC
                    return rdst == REG_PC ? 3 : 2;
            }
            else // src = @Rn+
            {
                if(ad == AM_REGISTER) // dst = Rm or dst = PC
                    return rdst == REG_PC ? 4 : 2;
            }
            return shorter ? 4 : 5;

        default:
            // Oops
            break;
    }
    return 0;
}

static size_t format2_0_cycles(uint8_t as)
{
    // Only for RRC, RRA, SWPB, SXT
    if(as == 1)
        return 1;
    if(as == 1)
        return 4;
    return 3;
}

static void extension_to_repeat(
    const extension_t &extension,
    ac_regbank<16, msp430x_parms::ac_word, msp430x_parms::ac_Dword>& RB,
    uint16_t &zc,
    uint16_t &al,
    uint16_t &count)
{
    zc = (extension.payload_h >> 1) & 1;
    al = extension.al;

    if(extension.payload_h & 1) // #
    {
        uint16_t rn = extension.payload_l & 0xf;
        count = 1 + (RB[rn] & 0xf);
    }
    else
        count = 1 + (extension.payload_l & 0xf);
}

static void extension_repeat(
    const extension_t &extension,
    extension_repeat_t &repeat,ac_regbank<16,
    msp430x_parms::ac_word, msp430x_parms::ac_Dword>& RB,
    uint8_t as,
    uint8_t ad,
    const std::string &instruction_name)
{
    repeat.zc = 0;
    repeat.al = 1;
    repeat.count = 1;

    if(extension.state == EXT_RUN)
    {
        //std::cout << "Extended " << instruction_name << std::endl;

        if(as == 0 && ad == 0)
        {
            extension_to_repeat(extension, RB, repeat.zc, repeat.al, repeat.count);
            //std::cout << " " << std::dec << repeat.count << " t imes" << std::endl;
        }
        else
            std::cerr << "Oops, extension not supported yet." << std::endl;
    }
}

// replay == true iff mpu
// replay == false otherwise
static void fire_interrupt(size_t source_id, bool replay)
{
    std::cout << "interrupt" << std::endl;

    // Push PC and SR
    context->DM.write(context->RB[REG_SP]-2, replay ? context->pc : context->RB[REG_PC]);
    context->DM.write(context->RB[REG_SP]-4, context->RB[REG_SR]);
    context->RB[REG_SP] -= 4;

    sr_flags_t sr(context->RB);
    sr.on_interrupt();

    // TODO: interrupt priority

    context->RB[REG_PC] = context->DM.read(0xff80 + (source_id << 1));
    context->ac_pc = context->RB[REG_PC];

    emanager->add_cycles(6, 0);

    context->ac_annul();
}

static void erase_memory_on_boot(ac_memory &DM)
{
    const uint8_t  sram_canary = 0xde;
    const uint8_t  periph_canary = 0xad;

    for(uint16_t i = SRAM_BEGIN; i < SRAM_END; ++i)
        DM.write_byte(i, sram_canary);

    for(uint16_t i = PERIPH_BEGIN; i < PERIPH_END; ++i)
        DM.write_byte(i, periph_canary);
}

static void apply_command(
    platform_t &platform,
    ac_regbank<16, msp430x_parms::ac_word, msp430x_parms::ac_Dword>& RB,
    const std::string &command)
{
    const std::string BAD_STATE("Bad profiler state: ");
    std::vector<std::string> instructions = str_split(command, ';');
    for(const std::string &instruction : instructions)
    {
        std::vector<std::string> fields = str_split(instruction, '=');
        if(fields.size() != 2)
        {
            std::cerr << "Bad profiler command: " << instruction << std::endl;
            continue;
        }

        if(fields[0] == "port")
        {
            if(fields[1] == "init")
                platform.port.init();
            else
                std::cerr << BAD_STATE << "port/" << fields[1] << std::endl;
        }
        else if(fields[0] == "temperature")
        {
            if(fields[1] == "init")
                platform.temperature.init();
            else
                std::cerr << BAD_STATE << "temperature/" << fields[1] << std::endl;
        }
        else if(fields[0] == "accelerometer")
        {
            if(fields[1] == "on")
            {
                platform.accelerometer.init();
                platform.accelerometer.on();
            }
            else
                std::cerr << BAD_STATE << "accelerometer/" << fields[1] << std::endl;
        }
        else if(fields[0] == "spi")
        {
            if(fields[1] == "init")
                platform.spi.init();
            else
                std::cerr << BAD_STATE << "spi/" << fields[1] << std::endl;
        }
        else if(fields[0] == "cc2500")
        {
            if(fields[1] == "idle")
            {
                platform.cc2500.init();
                platform.cc2500.idle();
            }
            else
                std::cerr << BAD_STATE << "cc2500/" << fields[1] << std::endl;
        }
        else if(fields[0][0] == 'r')
        {
            size_t reg = str2uint(fields[0].substr(1));
            if(reg >= 16)
            {
                std::cerr << BAD_STATE << "r" << std::dec << reg << " does not exist!" << std::endl;
                continue;
            }

            size_t value = str2uint(fields[1]);
            RB[reg] = value;
        }
        else if(fields[0][0] == '@')
        {
            std::cerr << "Profiler: initial memory state not yet supported" << std::endl;
        }
    }
}

//!Behavior executed before simulation begins.
void ac_behavior( begin )
{
    extern options_t *power_options; // Given by main.cpp

    mpu = new MPU(SRAM_BEGIN, SRAM_END, 16, DM, fire_interrupt, 39);
    supply = new PowerSupply(
        power_options->capacitance_nF,
        3.3,
        power_options->v_lo_V,
        power_options->v_hi_V,
        power_options->v_thres_V);
    platform = new platform_t(*mpu, *supply);
    emanager = new EnergyManager(elogger, *supply, *platform);
    commands = new Commands(*emanager);
    syscalls = new Syscalls(*platform, *emanager);
    syscalls->print();
    erase_memory_on_boot(DM);
    
    supply->set_infinite_energy(power_options->profiling);

