bernabeu-a/archc-msp430x/msp430x_isa.cpp
    if(power_options->profiling)
        apply_command(*platform, RB, power_options->profile_command);
}

//!Behavior executed after simulation ends.
void ac_behavior( end )
{
    delete syscalls;
    delete commands;
    delete emanager;
    delete platform;
    delete supply;
    delete mpu;
}

//!Generic instruction behavior method.
void ac_behavior( instruction )
{
    extern options_t *power_options; // Given by main.cpp

    delete context;
    context = new arch_context_t(DM, RB, ac_pc, std::bind(&msp430x_isa::ac_annul, this));
    context->pc = ac_pc;

    extension.tick();

    emanager->log();

    if(power_options->profiling && ac_pc == power_options->profile_to)
    {
        emanager->stop_log();
        std::exit(0);
    }

    //std::cout << std::endl;
    //std::cout << "pc=" << std::hex << ac_pc << std::endl;

    //std::cout << "sp=" << std::hex << RB[REG_SP] << std::endl;
    //std::cout << supply->voltage() << std::endl;
    
    switch(supply->get_state())
    {
        case ON:
            break;

        case INTERRUPT:
        {
            sr_flags_t sr(RB);
            if(sr.GIE)
            {
                fire_interrupt(60, false);
                ac_annul();
                return;
            }
            break;
        }

        default: // OFF
            supply->refill();
            emanager->stop_log();

            std::cout << "REBOOT" << std::endl;

            // Reboot
            RB[REG_PC] = DM.read(0xfffe); // Reset vector
            erase_memory_on_boot(DM);
            ac_pc = RB[REG_PC];

            static size_t total_lifecycles = 0;
            if(++total_lifecycles >= power_options->n_lifecycles)
                std::exit(0);

            ac_annul();
            return;
    }

    ac_pc += 2;
    RB[REG_PC] = ac_pc;
}
 
//! Instruction Format behavior methods.
void ac_behavior( Type_DoubleOp ) {}
void ac_behavior( Type_SimpleOp ) {}
void ac_behavior( Type_Jump ) {}
void ac_behavior( Type_PushPopM ){}
void ac_behavior( Type_Extension ){}
void ac_behavior( Type_Extended_II ){}
 
//!Instruction MOV behavior method.
void ac_behavior( MOV )
{
    uint16_t operand = doubleop_source(mpu, RB, as, bw, rsrc);

    if(rdst == REG_PC && syscalls->is_syscall(operand)) // Syscall: run symbolically
    {
        // BR instruction
        std::cout << "SYSCALL: " << syscalls->get_name(operand) << std::endl;
        doubleop_dest(mpu, RB, RB[REG_PC], ad, bw, rdst); // PC = next(PC)
        syscalls->run(operand, DM, RB);
    }
    else
        doubleop_dest(mpu, RB, operand, ad, bw, rdst);

    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(doubleop_cycles(as, ad, rsrc, rdst, true)), 0);
}

//!Instruction ADD behavior method.
void ac_behavior( ADD )
{
    extension_repeat_t repeat;
    extension_repeat(extension, repeat, RB, as, ad, "ADD");

    uint16_t operand_src = doubleop_source(mpu, RB, as, bw, rsrc);
    uint16_t operand_dst = doubleop_dest_operand(mpu, RB, ad, bw, rdst);
    uint16_t operand_tmp = operand_dst;
    sr_flags_t sr(RB);

    for(size_t i = repeat.count; i--; )
        operand_dst += operand_src;

    sr.set_Z(operand_dst == 0);
    if(bw)
    {
        sr.set_N(negative8(operand_dst));
        sr.set_V(overflow8(operand_src, operand_tmp, operand_dst));
    }
    else
    {
        sr.set_N(negative16(operand_dst));
        sr.set_V(overflow16(operand_src, operand_tmp, operand_dst));
    }

    uint32_t promoted_src = operand_src;
    uint32_t promoted_dst = operand_tmp;
    uint32_t promoted_result = promoted_dst;

    for(size_t i = repeat.count; i--; )
        promoted_result += promoted_src;

    if(bw)
        sr.set_C(carry8(promoted_result));
    else
        sr.set_C(carry16(promoted_result));

    doubleop_dest(mpu, RB, operand_dst, ad, bw, rdst);
    ac_pc = RB[REG_PC];
    extension.state = EXT_NONE;

    emanager->add_cycles(ESTIMATE_PIPELINE(doubleop_cycles(as, ad, rsrc, rdst, false)), 0);
}

//!Instruction ADDC behavior method.
void ac_behavior( ADDC )
{
    uint16_t operand_src = doubleop_source(mpu, RB, as, bw, rsrc);
    uint16_t operand_dst = doubleop_dest_operand(mpu, RB, ad, bw, rdst);
    uint16_t operand_tmp = operand_dst;
    sr_flags_t sr(RB);

    operand_src += sr.C;
    operand_dst += operand_src;

    sr.set_Z(operand_dst == 0);
    if(bw)
    {
        sr.set_N(negative8(operand_dst));
        sr.set_V(overflow8(operand_src, operand_tmp, operand_dst));
    }
    else
    {
        sr.set_N(negative16(operand_dst));
        sr.set_V(overflow16(operand_src, operand_tmp, operand_dst));
    }

    uint32_t promoted_src = operand_src + sr.C;
    uint32_t promoted_dst = operand_tmp;
    uint32_t promoted_result = promoted_src + promoted_dst;
    if(bw)
        sr.set_C(carry8(promoted_result));
    else
        sr.set_C(carry16(promoted_result));

    doubleop_dest(mpu, RB, operand_dst, ad, bw, rdst);
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(doubleop_cycles(as, ad, rsrc, rdst, false)), 0);
}

//!Instruction SUB behavior method.
void ac_behavior( SUB )
{
    uint16_t operand_src = doubleop_source(mpu, RB, as, bw, rsrc);
    uint16_t operand_dst = doubleop_dest_operand(mpu, RB, ad, bw, rdst);
    uint16_t operand_tmp = operand_dst;
    sr_flags_t sr(RB);

    operand_src = ~operand_src + 1;
    operand_dst += operand_src;

    sr.set_Z(operand_dst == 0);
    if(bw)
    {
        sr.set_N(negative8(operand_dst));
        sr.set_V(overflow8(operand_src, operand_tmp, operand_dst));
    }
    else
    {
        sr.set_N(negative16(operand_dst));
        sr.set_V(overflow16(operand_src, operand_tmp, operand_dst));
    }

    uint32_t promoted_src = ~operand_src + 1;
    uint32_t promoted_dst = operand_tmp;
    uint32_t promoted_result = promoted_src + promoted_dst;
    if(bw)
        sr.set_C(carry8(promoted_result));
    else
        sr.set_C(carry16(promoted_result));

    doubleop_dest(mpu, RB, operand_dst, ad, bw, rdst);
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(doubleop_cycles(as, ad, rsrc, rdst, false)), 0);
}

