bernabeu-a/archc-msp430x/msp430x_isa.cpp
//!Instruction SUBC behavior method.
void ac_behavior( SUBC )
{
    uint16_t operand_src = doubleop_source(mpu, RB, as, bw, rsrc);
    uint16_t operand_dst = doubleop_dest_operand(mpu, RB, ad, bw, rdst);
    uint16_t operand_tmp = operand_dst;
    sr_flags_t sr(RB);

    operand_src = ~operand_src + sr.C;
    operand_dst += operand_src;

    sr.set_Z(operand_dst == 0);
    if(bw)
    {
        sr.set_N(negative8(operand_dst));
        sr.set_V(overflow8(operand_src, operand_tmp, operand_dst));
    }
    else
    {
        sr.set_N(negative16(operand_dst));
        sr.set_V(overflow16(operand_src, operand_tmp, operand_dst));
    }

    uint32_t promoted_src = ~operand_src + sr.C;
    uint32_t promoted_dst = operand_tmp;
    uint32_t promoted_result = promoted_src + promoted_dst;
    if(bw)
        sr.set_C(carry8(promoted_result));
    else
        sr.set_C(carry16(promoted_result));

    doubleop_dest(mpu, RB, operand_dst, ad, bw, rdst);
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(doubleop_cycles(as, ad, rsrc, rdst, false)), 0);
}

//!Instruction CMP behavior method.
void ac_behavior( CMP )
{
    uint16_t operand_src = doubleop_source(mpu, RB, as, bw, rsrc);
    uint16_t operand_dst = doubleop_dest_operand(mpu, RB, ad, bw, rdst);
    uint16_t operand_tmp = operand_dst;
    sr_flags_t sr(RB);

    sr.set_C(operand_dst >= operand_src);

    operand_src = ~operand_src+1;
    operand_dst += operand_src;

    sr.set_Z(operand_dst == 0);
    if(bw)
    {
        sr.set_N(negative8(operand_dst));
        sr.set_V(overflow8(operand_src, operand_tmp, operand_dst));
    }
    else
    {
        sr.set_N(negative16(operand_dst));
        sr.set_V(overflow16(operand_src, operand_tmp, operand_dst));
    }

    // Do not change the value
    doubleop_dest(mpu, RB, operand_tmp, ad, bw, rdst);
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(doubleop_cycles(as, ad, rsrc, rdst, true)), 0);
}

//!Instruction DADD behavior method.
void ac_behavior( DADD )
{
    std::cerr << "Oops (DADD)" << std::endl;
}

//!Instruction BIT behavior method.
void ac_behavior( BIT )
{
    uint16_t operand_src = doubleop_source(mpu, RB, as, bw, rsrc);
    uint16_t operand_dst = doubleop_dest_operand(mpu, RB, ad, bw, rdst);
    uint16_t tmp = operand_dst;
    sr_flags_t sr(RB);

    operand_dst &= operand_src;

    sr.set_Z(operand_dst == 0);
    sr.set_C(operand_dst != 0);
    sr.set_V(0);
    if(bw)
        sr.set_N(negative8(operand_dst));
    else
        sr.set_N(negative16(operand_dst));

    // Do not change the value
    doubleop_dest(mpu, RB, tmp, ad, bw, rdst);
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(doubleop_cycles(as, ad, rsrc, rdst, true)), 0);
}

//!Instruction BIC behavior method.
void ac_behavior( BIC )
{
    uint16_t operand_src = doubleop_source(mpu, RB, as, bw, rsrc);
    uint16_t operand_dst = doubleop_dest_operand(mpu, RB, ad, bw, rdst);

    operand_dst &= ~operand_src;

    doubleop_dest(mpu, RB, operand_dst, ad, bw, rdst);
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(doubleop_cycles(as, ad, rsrc, rdst, false)), 0);
}

//!Instruction BIS behavior method.
void ac_behavior( BIS )
{
    uint16_t operand_src = doubleop_source(mpu, RB, as, bw, rsrc);
    uint16_t operand_dst = doubleop_dest_operand(mpu, RB, ad, bw, rdst);

    operand_dst |= operand_src;

    doubleop_dest(mpu, RB, operand_dst, ad, bw, rdst);
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(doubleop_cycles(as, ad, rsrc, rdst, false)), 0);
}

//!Instruction XOR behavior method.
void ac_behavior( XOR )
{
    uint16_t operand_src = doubleop_source(mpu, RB, as, bw, rsrc);
    uint16_t operand_dst = doubleop_dest_operand(mpu, RB, ad, bw, rdst);
    uint16_t operand_tmp = operand_dst;
    sr_flags_t sr(RB);

    operand_dst ^= operand_src;

    sr.set_Z(operand_dst == 0);
    sr.set_C(operand_dst != 0);
    if(bw)
    {
        sr.set_N(negative8(operand_dst));
        sr.set_V(negative8(operand_src) && negative8(operand_tmp));
    }
    else
    {
        sr.set_N(negative16(operand_dst));
        sr.set_V(negative16(operand_src) && negative16(operand_tmp));
    }

    doubleop_dest(mpu, RB, operand_dst, ad, bw, rdst);
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(doubleop_cycles(as, ad, rsrc, rdst, false)), 0);
}

//!Instruction AND behavior method.
void ac_behavior( AND )
{
    uint16_t operand_src = doubleop_source(mpu, RB, as, bw, rsrc);
    uint16_t operand_dst = doubleop_dest_operand(mpu, RB, ad, bw, rdst);
    sr_flags_t sr(RB);

    operand_dst &= operand_src;

    sr.set_Z(operand_dst == 0);
    sr.set_C(operand_dst != 0);
    sr.set_V(0);
    if(bw)
        sr.set_N(negative8(operand_dst));
    else
        sr.set_N(negative16(operand_dst));

    doubleop_dest(mpu, RB, operand_dst, ad, bw, rdst);
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(doubleop_cycles(as, ad, rsrc, rdst, false)), 0);
}

//!Instruction RRC behavior method.
void ac_behavior( RRC )
{
    uint16_t operand = doubleop_source(mpu, RB, ad, bw, rdst);
    uint16_t operand_tmp = operand;
    sr_flags_t sr(RB);

    operand >>= 1;
    if(bw)
    {
        operand |= (sr.C ? 0xff80 : 0x0);
        sr.set_N(negative8(operand));
    }
    else
    {
        operand |= (sr.C << 15);
        sr.set_N(negative16(operand));
    }

    sr.set_V(0);
    sr.set_Z(operand == 0);
    sr.set_C(operand_tmp & 1);

    doubleop_dest(mpu, RB, operand, ad, bw, rdst);
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(format2_0_cycles(ad)), 0);
}

//!Instruction RRA behavior method.
void ac_behavior( RRA )
{
    extension_repeat_t repeat;
    if(extension.state == EXT_RUN)
    {
        //std::cout << "Extended RRA" << std::endl;

        if(ad == 0)
        {
            extension_to_repeat(extension, RB, repeat.zc, repeat.al, repeat.count);
            //std::cout << " " << std::dec << repeat.count << " times" << std::endl;
        }
        else
            std::cerr << "Oops, extension not supported yet." << std::endl;
    }

