bernabeu-a/archc-msp430x/msp430x_isa.cpp
    uint16_t operand = doubleop_source(mpu, RB, ad, bw, rdst);
    sr_flags_t sr(RB);

    for(size_t i = repeat.count; i--; )
    {
        sr.set_C(operand & 1);
        operand = ((operand & 0x8000) | (operand >> 1));
    }

    if(bw)
        sr.set_N(negative8(operand));
    else
        sr.set_N(negative16(operand));

    sr.set_V(0);
    sr.set_Z(operand == 0);

    doubleop_dest(mpu, RB, operand, ad, bw, rdst);
    ac_pc = RB[REG_PC];
    extension.state = EXT_NONE;

    emanager->add_cycles(ESTIMATE_PIPELINE(format2_0_cycles(ad)), 0);
}

//!Instruction PUSH behavior method.
void ac_behavior( PUSH )
{
    uint16_t operand = doubleop_source(mpu, RB, ad, bw, rdst);
    RB[REG_SP] -= 2;
    if(bw)
        mpu->write_byte(RB[REG_SP], operand);
    else
        mpu->write(RB[REG_SP], operand);
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(ad == AM_REGISTER ? 3 : 4), 0);
}

//!Instruction SWPB behavior method.
void ac_behavior( SWPB )
{
    std::cerr << "Oops (SWPB)" << std::endl;
}

//!Instruction CALL behavior method.
void ac_behavior( CALL )
{
    uint16_t address = doubleop_source(mpu, RB, ad, 0, rdst);
    if(commands->run(address)) // Program issued a simulation command
    {
        ac_pc = RB[REG_PC];
        return;
    }
    else if(syscalls->is_syscall(address)) // Syscall: run symbolically
    {
        std::cout << "SYSCALL: " << syscalls->get_name(address) << std::endl;
        syscalls->run(address, DM, RB);
    }
    else // Actually run the call
    {
        RB[REG_SP] -= 2;
        DM.write(RB[REG_SP], RB[REG_PC]);

        extern options_t *power_options; // Given by main.cpp
        // Regular case: jump to the requested address
        if(!power_options->profiling || address != power_options->profile_main)
            RB[REG_PC] = address;
        else // In profiler mode: if jumping to main, jump to profile_from instead
        {
            RB[REG_PC] = power_options->profile_from;
            emanager->start_log();
        }
    }

    ac_pc = RB[REG_PC];

    if(ad == AM_REGISTER)
        emanager->add_cycles(ESTIMATE_PIPELINE(4), 0);
    else if(rdst == REG_SR)
        emanager->add_cycles(ESTIMATE_PIPELINE(6), 0);
    else
        emanager->add_cycles(ESTIMATE_PIPELINE(5), 0);
}

//!Instruction RETI behavior method.
void ac_behavior( RETI )
{
    // Pop SR and PC
    RB[REG_SR] = DM.read(RB[REG_SP]);
    RB[REG_PC] = DM.read(RB[REG_SP] + 2);
    RB[REG_SP] += 4;

    ac_pc = RB[REG_PC];
    emanager->add_cycles(ESTIMATE_PIPELINE(5), 0);
}

//!Instruction SXT behavior method.
void ac_behavior( SXT )
{
    std::cout << "Oops (SXT)" << std::endl;
}

//!Instruction JZ behavior method.
void ac_behavior( JZ )
{
    sr_flags_t sr(RB);
    if(sr.Z)
    {
        int16_t signed_offset = 2 * u10_to_i16(offset);
        RB[REG_PC] += signed_offset;
        // TODO: Check whether PC gets incremented by 2 at the end (should be true)
    }
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(2), 0);
}

//!Instruction JNZ behavior method.
void ac_behavior( JNZ )
{
    sr_flags_t sr(RB);
    if(!sr.Z)
    {
        int16_t signed_offset = 2 * u10_to_i16(offset);
        RB[REG_PC] += signed_offset;
        // TODO: Check whether PC gets incremented by 2 at the end (should be true)
    }
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(2), 0);
}

//!Instruction JC behavior method.
void ac_behavior( JC )
{
    sr_flags_t sr(RB);
    if(sr.C)
    {
        int16_t signed_offset = 2 * u10_to_i16(offset);
        RB[REG_PC] += signed_offset;
        // TODO: Check whether PC gets incremented by 2 at the end (should be true)
    }
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(2), 0);
}

//!Instruction JNC behavior method.
void ac_behavior( JNC )
{
    sr_flags_t sr(RB);
    if(!sr.C)
    {
        int16_t signed_offset = 2 * u10_to_i16(offset);
        RB[REG_PC] += signed_offset;
        // TODO: Check whether PC gets incremented by 2 at the end (should be true)
    }
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(2), 0);
}

//!Instruction JN behavior method.
void ac_behavior( JN )
{
    sr_flags_t sr(RB);
    if(sr.N)
    {
        int16_t signed_offset = 2 * u10_to_i16(offset);
        RB[REG_PC] += signed_offset;
        // TODO: Check whether PC gets incremented by 2 at the end (should be true)
    }
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(2), 0);
}

//!Instruction JGE behavior method.
void ac_behavior( JGE )
{
    sr_flags_t sr(RB);
    if(!(sr.N ^ sr.V))
    {
        int16_t signed_offset = 2 * u10_to_i16(offset);
        RB[REG_PC] += signed_offset;
        // TODO: Check whether PC gets incremented by 2 at the end (should be true)
    }
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(2), 0);
}

//!Instruction JL behavior method.
void ac_behavior( JL )
{
    sr_flags_t sr(RB);
    if(sr.N ^ sr.V)
    {
        int16_t signed_offset = 2 * u10_to_i16(offset);
        RB[REG_PC] += signed_offset;
        // TODO: Check whether PC gets incremented by 2 at the end (should be true)
    }
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(2), 0);
}

//!Instruction JMP behavior method.
void ac_behavior( JMP )
{
    int16_t signed_offset = 2 * u10_to_i16(offset);
    uint16_t address = RB[REG_PC] + signed_offset;
    if(syscalls->is_syscall(address)) // Syscall: run symbolically
    {
        std::cout << "SYSCALL: " << syscalls->get_name(address) << std::endl;
        syscalls->run(address, DM, RB);
    }
    else // Actually run the call
        RB[REG_PC] = address;
    ac_pc = RB[REG_PC];

    emanager->add_cycles(ESTIMATE_PIPELINE(2), 0);
}

//!Instruction PUSHPOPM behavior method.
void ac_behavior( PUSHPOPM )
{
    uint16_t n = 1 + n1;
    uint16_t rdst = rdst1;

    /*
    std::cout << "PUSHPOP:" << std::endl
              << " n=" << std::dec << n << std::endl
              << " rdst=" << rdst << std::endl
              << " before: SP=" << std::hex << RB[REG_SP] << std::endl;

    */

    if(!subop) // PUSHM
    {
        if(word) // PUSHM
        {
            for(; n--; --rdst)
            {
                RB[REG_SP] -= 2;
                mpu->write(RB[REG_SP], RB[rdst]);
            }
        }
        else // PUSHM.A
        {
            std::cerr << "Warning: PUSHM.A: bits 16-19 set to 0" << std::endl;
            for(; n--; --rdst)
            {
                RB[REG_SP] -= 2;
                mpu->write(RB[REG_SP], 0); // Bits 16-19 set to 0
                RB[REG_SP] -= 2;
                mpu->write(RB[REG_SP], RB[rdst]);
            }

