bernabeu-a/archc-msp430x/msp430x_isa.cpp
        }
    }
    else // POPM
    {
        if(word) // POPM
        {
            for(; n--; ++rdst)
            {
                RB[rdst] = mpu->read(RB[REG_SP]);
                RB[REG_SP] += 2;
            }
        }
        else // POPM.A
        {
            std::cerr << "Warning: POPM.A: bits 16-19 set to 0" << std::endl;
            for(; n--; ++rdst)
            {
                RB[rdst] = mpu->read(RB[REG_SP]);
                RB[REG_SP] += 4; // Bits 16-19 ignored / set to 0
            }
        }
    }
    ac_pc = RB[REG_PC];

    /*
    std::cout << " after: SP=" << std::hex << RB[REG_SP] << std::endl
              << std::endl;
    */

    // PUSHM, POPM -> 2+n
    // PUSHM.A, POPM.A -> 2+2n
    emanager->add_cycles(ESTIMATE_PIPELINE(2 + (word ? n : 2*n)), 0);
}

//!Instruction EXT behavior method.
void ac_behavior( EXT )
{
    extension.payload_h = payload_h;
    extension.payload_l = payload_l;
    extension.al        = al;

    //std::cout << "Extension!" << std::endl;
    if(extension.state != EXT_NONE)
        std::cerr << "Bad extension state (Oops)" << std::endl;
    if(!al)
        std::cerr << "20-bit words not supported (Oops)" << std::endl;

    extension.state = EXT_RDY;

}

//!Instruction RRCM behavior method.
void ac_behavior( RRCM )
{
    std::cerr << "Oops (RRCM)" << std::endl;
}

//!Instruction RRAM behavior method.
void ac_behavior( RRAM )
{
    std::cerr << "Oops (RRAM)" << std::endl;
}

//!Instruction RRUM behavior method.
void ac_behavior( RRUM )
{
    if(!w)
        std::cerr << "Oops (RRUM.A)" << std::endl;

    size_t n = n_1+1;
    uint16_t operand = RB[dst];
    sr_flags_t sr(RB);

    sr.set_C(operand & (1 << n_1));
    operand >>= n;

    sr.set_N(negative16(operand));
    sr.set_V(0);
    sr.set_Z(operand == 0);

    RB[dst] = operand;

    emanager->add_cycles(ESTIMATE_PIPELINE(n), 0);
}

//!Instruction RLAM behavior method.
void ac_behavior( RLAM )
{
    std::cerr << "Oops (RLAM)" << std::endl;
}

